{
    "11204": {
        "glensOcr": "Introduction to Analysis of Algorithms/Slide 2 Introduction - What is Algorithm? 1 a clearly specified set of simple instructions to be followed to solve a problem Takes a set of values, as input and O produces a value, or set of values, as output - May be specified eln English CAs a computer program CAs a pseudo-code M Data structures - Methods of organizing data Program = algorithms + data structures ",
        "pp1": "Enumerated facts, paragraph, and pseudocode Utilized for clarification of introduction to analysis of algorithms/slide 2 introduction ",
        "pp2": "Highlighted elements, Section, and algorithm Employed for illustration of introduction to analysis of algorithms/slide 2 introduction ",
        "pp3": "introduction to analysis of algorithms/slide 2 introduction explained using Key details, Section, and pseudocode.",
        "pp4": "enumeration, Block of text, and pseudocode Employed to elucidate the introduction to analysis of algorithms/slide 2 introduction ",
        "summary": "introduction to analysis of algorithms/slide 2 introduction  explains using   enumeration,  paragraph,  pseudocode"
    },
    "11297": {
        "glensOcr": "What Is Recursion? • Recursive call · A method call in which the method being called is the same as the one making the call • Direct recursion Recursion in which a method directly calls itself • Indirect recursion - Recursion in which a chain of two or more method calls returns to the method that originated the chain ",
        "pp1": "bullet points, and paragraph Employed to elucidate the ",
        "pp2": "Outlined features, and paragraph Utilized for exposition of ",
        "pp3": "Enumerated facts, and Block of text Utilized for clarification of ",
        "pp4": "elucidates utilizing Outlined features, and text Segment.",
        "summary": "explains using   enumeration,  paragraph"
    },
    "25799": {
        "glensOcr": "Evaluating Postfix Expression Evaluating Postfix Expression: scan given postfix expression; for each symbol in postfix if operand then push its value onto a stack S; if operator then { pop operand2; pop operand1; apply operator to compute operand1 op operand2; push result back onto stack S; return value at top of stack; ",
        "pp1": "Highlighted elements, Passage, and algorithm Utilized for clarification of evaluating postfix expression ",
        "pp2": "evaluating postfix expression elucidates utilizing Key details, Block of text, and algorithm.",
        "pp3": "evaluating postfix expression elucidated by Outlined features, Passage, and pseudocode.",
        "pp4": "enumeration, text Segment, and pseudocode Employed for illustration of evaluating postfix expression ",
        "summary": "evaluating postfix expression  explains using   enumeration,   paragraph,  pseudocode,"
    },
    "26804": {
        "glensOcr": "Depotment of Computer Science & Applications Department with potentisi for excellence D.A.V.Cellege For Girle Gamana Nagar Passwort Computer Science han Sie Ihr Passwort What is the difference? • Stack & Queue vs. Array rls Arrays are data storage structures while stacks and queues are specialized DS and used as programmer's tools. » Stack - a container that allows push and pop • Queue dequeue a container that allows an queue and • No concern on implementation details. Back ",
        "pp1": "what is the difference? rls elucidates utilizing Notable entries, Block of text, natural image, and logo.",
        "pp2": "bullet points, text Segment, photograph, and logo Employed to elucidate the what is the difference? rls ",
        "pp3": "Distinctive highlights, Passage, photograph, and logo Employed for illustration of what is the difference? rls ",
        "pp4": "what is the difference? rls elucidated by Itemized points, paragraph, picture, and logo.",
        "summary": "what is the difference? rls  explains using   enumeration,   paragraph,  , photograph, logo"
    },
    "84346": {
        "glensOcr": "? Support Vector Machines (SVM) Method for supervised learning problems Classification - Regression ? Two key ideas Assuming linearly separable classes, learn separating hyperplane with maximum margin - ? Expand input into high-dimensional space to deal with linearly non-separable cases (such as the XOR)",
        "pp1": "support vector machines clarifies utilizing enumeration, and Passage.",
        "pp2": "Itemized points, and Section Employed for illustration of support vector machines ",
        "pp3": "enumeration, and Section Utilized for clarification of support vector machines ",
        "pp4": "support vector machines elucidated by Highlighted elements, and Passage.",
        "summary": "support vector machines explains using enumeration, paragraph"
    }
}